
/// <summary>
/// 深埋宝藏(推箱子)界面
/// </summary>
public class SokobanView : UIViewBase
{
    /*
    弹窗,提示去挖掘
    副本界面6*8
    可以推动区域\箱子\箱子孔\障碍物\大门
    箱子生成规则
    障碍物生成规则
    箱子孔(放置点)生成规则
    英雄占位推动上下左右
    所有箱子孔填满后开门
    英雄还要寻路,走可以行走的路线
    中途离开弹窗
    大门打开特效
    挖掘表现+进度条
    挖掘标记=次数足够显示
    通用奖励界面
    弹传承BOSS关卡界面
    挑战界面无法关闭，5秒后自动进入战斗
    */

    //初始化地图（包含玩家英雄角色）
    private void InitMap()
    {

    }
    //生成单个箱子
    
    //生成单个障碍物
    
    //生成单个箱子放置点（箱子孔）
    
    //检测单个箱子是否完成
    
    //播放完成大门特效
    
    //播放挖掘表现
    
    //打开弹窗提示入口
    
    //打开奖励界面
    
    //打开中途离开弹窗
    
    //打开传承boss界面
    
    //推动箱子操作
}